export default [
  {
    type: "radio",
    title: "Когда система передана заказчику, начинается этап:",
    answer: ["кодирования", "тестирования", "эксплуатации", "верификации", "анализа"],
    good: "эксплуатации"
  },
  {
    type: "checkbox",
    title: "С точки зрения пользователя программного обеспечения качество последнего заключается в",
    answer: ["легкости эксплуатации", "модификации", "безотказности", "производительности", "воспроизводимости"],
    good: ["легкости эксплуатации", "безотказности", "производительности"]
  },
  {
    type: "checkbox",
    title: "Среди уровней абстракции стадий проектирования различают",
    answer: ["способы проектирования", "специфика дизайна системы", "детальное кодирование", "атрибуты и требования приложений", "стандарты разработки"],
    good: ["способы проектирования", "стандарты разработки"]
  },
  {
    type: "radio",
    title: "Тестирование выполнения программы без знания того, как она спроектирована и запрограммирована называют тестированием методом",
    answer: ["белого ящика", "черного ящика", "темной комнаты", "методом «орел-решка»"],
    good: "черного ящика"
  },
  {
    type: "checkbox",
    title: " Среди типов стандартной архитектуры различают",
    answer: ["транспонируемый", "«классной доски»", "Конвейерный", "на событиях"],
    good: ["«классной доски»", "Конвейерный", "на событиях"]
  }
];
